Public Member Functions | Protected Member Functions | Friends | List of all members
ACAPI::ModifierBase Class Reference
Command Scopes
Base class of every Modifier classes used in ExecuteUndoableScope/ExecuteNotUndoableScope/CallDefaultModifier function. More...
#include <ModifyScope.hpp>
 Public Member Functions
virtual  | ~ModifierBase ()
 Protected Member Functions
virtual void  | FinalizeModification ()
 Friends
template<typename Modifier , typename UnaryInvocable >
ACAPI::Result< void >  | ExecuteUndoableScope (const UnaryInvocable &, Modifier &, const ACAPI::Object &, const GS::UniString &)
template<typename Modifier , typename UnaryInvocable >
ACAPI::Result< void >  | ExecuteNotUndoableScope (const UnaryInvocable &, Modifier &, const ACAPI::Object &)
template<typename Modifier , typename UnaryInvocable >
ACAPI::Result< void >  | CallDefaultModifier (UnaryInvocable &&, Modifier &)
Detailed Description
Base class of every Modifier classes used in ExecuteUndoableScope/ExecuteNotUndoableScope/CallDefaultModifier function.
Constructor & Destructor Documentation
◆ ~ModifierBase()
 virtual ACAPI::ModifierBase::~ModifierBase  |  ( |   | )
virtual
Member Function Documentation
◆ FinalizeModification()
 virtual void ACAPI::ModifierBase::FinalizeModification  |  ( |   | )
protectedvirtual
Friends And Related Symbol Documentation
◆ CallDefaultModifier
 template<typename Modifier , typename UnaryInvocable >
 ACAPI::Result< void > CallDefaultModifier  |  ( |  UnaryInvocable &&  |  ,
|  Modifier &
)
friend
◆ ExecuteNotUndoableScope
 template<typename Modifier , typename UnaryInvocable >
 ACAPI::Result< void > ExecuteNotUndoableScope  |  ( |  const UnaryInvocable &  |  ,
|  Modifier &  |  ,
|  const ACAPI::Object &
)
friend
◆ ExecuteUndoableScope
 template<typename Modifier , typename UnaryInvocable >
 ACAPI::Result< void > ExecuteUndoableScope  |  ( |  const UnaryInvocable &  |  ,
|  Modifier &  |  ,
|  const ACAPI::Object &  |  ,
|  const GS::UniString &
)
friend